/* eslint-disable strict */
/*
 * @Author: KokoTa
 * @Date: 2020-11-03 12:25:48
 * @LastEditTime: 2020-11-25 09:33:34
 * @LastEditors: KokoTa
 * @Description:
 * @FilePath: /uni-wx-be/app/config/errorCode.js
 */
module.exports = {
  10000: '用户不存在或被禁用',
  10001: '用户已存在',
  10003: '登录密码错误',
  10004: '缓存失败',
  10005: '没有权限',
  10006: 'token不合法',
  10007: '用户未登录或重复登录',
  10008: '用户被禁用',
  10009: '好友申请不能添加自己',
  10010: '好友申请已存在',
  10011: '好友申请失败',
  10012: '好友申请不存在',
  10013: '好友不存在',
  10014: '好友不存在或已被拉黑',
  10015: '不能举报自己',
  10016: '举报已存在',
  10017: '无效的访问',
  10018: 'socket不存在',
  10019: '群聊创建失败',
  10020: '群聊加入失败',
  10021: '群聊不存在或被封禁',
  10022: '用户不存在于群聊中',
  10023: '离线消息不存在',
  10024: '群聊中没有任何用户',
  10025: '群聊不存在',
  10026: '请选择上传文件',
  10027: '上传失败',
  10028: '收藏创建失败',
};
